#include <iostream>

int main(int argc, char * argv[])
{
    // Прикладной код должен содержать следующие вызовы:
    // - создание экземпляра std::map<int, int>
    // - заполнение 10 элементами, где ключ - это число от 0 до 9, а значение - факториал ключа
    // - создание экземпляра std::map<int, int> с новым аллокатором, ограниченным 10
    // элементами
    // - заполнение 10 элементами, где ключ - это число от 0 до 9, а значение - факториал ключа
    // - вывод на экран всех значений (ключ и значение разделены пробелом) хранящихся в контейнере
    // - создание экземпляра своего контейнера для хранения значений типа int
    // - заполнение 10 элементами от 0 до 9
    // - создание экземпляра своего контейнера для хранения значений типа int с новым аллокатором,
    // ограниченным 10 элементами
    // - заполнение 10 элементами от 0 до 9
    // - вывод на экран всех значений, хранящихся в контейнере
    return 0;
}